{
  "songseek": {
    "title": "SongSeek",
    "description": "Plataforma de migración de música full-stack para convertir listas de reproducción entre Spotify, YouTube Music, Deezer, Apple Music y más.",
    "longDescription": "SongSeek es una plataforma de migración de música completa que permite a los usuarios convertir listas de reproducción entre los principales servicios de streaming. Construida con React y Express, cuenta con algoritmos de coincidencia inteligentes, autenticación OAuth, actualizaciones de estado en tiempo real a través de Server-Sent Events, búsqueda y creación de listas de reproducción a través de APIs oficiales, y una interfaz moderna optimizada para móviles. La plataforma soporta conversión bidireccional entre Spotify, YouTube Music, Deezer, Apple Music, Tidal y Amazon Music, con opciones de corrección manual para pistas no coincidentes y un panel de administración con análisis de conversiones."
  },
  "puntocultura": {
    "title": "PuntoCultura",
    "description": "Plataforma web full-stack para gestionar y mostrar eventos e instituciones culturales para el Departamento de Cultura de Santiago del Estero.",
    "longDescription": "PuntoCultura es una plataforma web integral desarrollada para el Departamento de Cultura de Santiago del Estero. Construida con Django REST Framework y JavaScript vanilla, cuenta con control de acceso basado en roles, autenticación JWT, APIs RESTful, un panel de administración avanzado con operaciones CRUD, vistas de calendario con FullCalendar, sistema de filtrado avanzado, middleware de protección contra inyección SQL, y una interfaz moderna y responsiva. La plataforma permite a administradores y editores gestionar eventos culturales, instituciones y contenido con soporte para borradores y flujos de publicación."
  },
  "tupdf": {
    "title": "TuPDF",
    "description": "Kit de herramientas PDF de código abierto y ligero para navegadores modernos con procesamiento del lado del cliente para privacidad y velocidad.",
    "longDescription": "TuPDF es un kit de herramientas PDF completo que se ejecuta completamente en el navegador, garantizando privacidad y cero dependencias del servidor. Construido con Next.js, React, TypeScript y MUI, cuenta con división de PDF (extraer páginas específicas o rangos), fusión de PDF (combinar múltiples archivos), organización de páginas (reorganizar, rotar, eliminar páginas con cuadrícula visual), conversión de página a imagen (exportación PNG/JPG), optimización y compresión de PDF, internacionalización completa (8 idiomas), interfaz moderna responsiva con modo oscuro, y procesamiento 100% del lado del cliente para máxima privacidad. Todas las operaciones usan Web APIs y se ejecutan localmente en el navegador."
  },
  "ahorcado": {
    "title": "Ahorcado",
    "description": "Juego del ahorcado moderno construido con Next.js, TypeScript y TailwindCSS con soporte multiidioma y generación dinámica de palabras.",
    "longDescription": "Ahorcado es una implementación moderna del juego clásico del ahorcado, featuring una hermosa interfaz inspirada en Material Design. Construido con Next.js 15, TypeScript y TailwindCSS, incluye soporte multiidioma (español e inglés), generación dinámica de palabras desde la API de Datamuse, múltiples niveles de dificultad (Fácil, Intermedio, Difícil), soporte de modo oscuro, diseño responsivo, soporte completo de entrada de teclado, sistema de seguimiento de puntuación, y animaciones suaves. El juego proporciona una experiencia de usuario atractiva con retroalimentación en tiempo real y controles intuitivos."
  },
  "clipper": {
    "title": "Clipper",
    "description": "Aplicación de escritorio minimalista para recortar, codificar y subir videos usando FFmpeg con una GUI intuitiva.",
    "longDescription": "Clipper es una aplicación GUI moderna y accesible para procesamiento de video construida con Python y Tkinter. Proporciona una interfaz intuitiva para recorte de video con línea de tiempo interactiva, preajustes de codificación (Muy Rápido a Muy Lento), opciones de codificación avanzadas (códec personalizado, CRF, FPS, resolución, velocidad), múltiples formatos de salida (MP4, MKV, WebM), funcionalidad de subida integrada a servicios de alojamiento de archivos, actualizaciones de progreso en tiempo real, procesamiento con hilos para evitar congelamientos de la UI, y un diseño oscuro inspirado en Material. Perfecto para procesar rápidamente archivos de video de películas, capturas de juego y programas de TV."
  },
  "userscripts": {
    "title": "Userscripts",
    "description": "Una colección de userscripts ligeros para mejorar la experiencia de navegación web con controles de teclado, limpieza de URL y utilidades de navegación.",
    "longDescription": "Una colección de userscripts ligeros para mejorar la experiencia de navegación web con controles de teclado, limpieza de URL y utilidades de navegación."
  }
}
